; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_3 ?v7 - type_3 ?v5 - type_2)
 	      (pred_2 ?v6 - object ?v5 - type_2)
	      (pred_1 ?v7 - type_3 ?v1 - type_1)
	      (pred_4 ?v7 - type_3 ?v6 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v7 - type_3 ?v8 ?v2 - type_2)
       :precondition (and  (pred_3 ?v7 ?v8))
       :effect (and  (pred_3 ?v7 ?v2)
		     (not (pred_3 ?v7 ?v8))))

   (:action op_3
       :parameters (?v7 - type_3 ?v3 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_2 ?v3 ?v4) (pred_3 ?v7 ?v4) (pred_1 ?v7 ?v1))
       :effect (and (pred_4 ?v7 ?v3 ?v1)
		    (not (pred_2 ?v3 ?v4)) 
		    (not (pred_1 ?v7 ?v1))))

   (:action op_2
       :parameters (?v7 - type_3 ?v3 - object ?v4 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v7 ?v3 ?v1) (pred_3 ?v7 ?v4))
       :effect (and (pred_2 ?v3 ?v4)
		    (pred_1 ?v7 ?v1)
		    (not (pred_4 ?v7 ?v3 ?v1)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_04 - type_3
obj_06 obj_05 obj_01 obj_03 - type_1
obj_07 obj_02 obj_09 obj_13 - type_2
obj_12 obj_11 obj_10 obj_14 - object)
(:init
(pred_3 obj_08 obj_13)
(pred_1 obj_08 obj_06)
(pred_1 obj_08 obj_05)
(pred_3 obj_04 obj_02)
(pred_1 obj_04 obj_01)
(pred_1 obj_04 obj_03)
(pred_2 obj_12 obj_13)
(pred_2 obj_11 obj_07)
(pred_2 obj_10 obj_09)
(pred_2 obj_14 obj_02)
)
(:goal
(and
(pred_2 obj_12 obj_02)
(pred_2 obj_11 obj_07)
(pred_2 obj_10 obj_02)
(pred_2 obj_14 obj_13)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_08 obj_13) (pred_3 obj_04 obj_13))))
  )
)
)

; plan
1. (op_3 obj_04 obj_14 obj_02 obj_03)
   deleted: (pred_2 obj_14 obj_02) (pred_1 obj_04 obj_03)
   added: (pred_4 obj_04 obj_14 obj_03)
   goals met: 1 of 4
2. (op_3 obj_08 obj_12 obj_13 obj_05)
   deleted: (pred_2 obj_12 obj_13) (pred_1 obj_08 obj_05)
   added: (pred_4 obj_08 obj_12 obj_05)
   goals met: 1 of 4
3. (op_1 obj_08 obj_13 obj_02)
   deleted: (pred_3 obj_08 obj_13)
   added: (pred_3 obj_08 obj_02)
   goals met: 1 of 4
4. (op_1 obj_04 obj_02 obj_13)
   deleted: (pred_3 obj_04 obj_02)
   added: (pred_3 obj_04 obj_13)
   goals met: 1 of 4
5. (op_2 obj_04 obj_14 obj_13 obj_03)
   deleted: (pred_4 obj_04 obj_14 obj_03)
   added: (pred_2 obj_14 obj_13) (pred_1 obj_04 obj_03)
   goals met: 2 of 4
6. (op_2 obj_08 obj_12 obj_02 obj_05)
   deleted: (pred_4 obj_08 obj_12 obj_05)
   added: (pred_2 obj_12 obj_02) (pred_1 obj_08 obj_05)
   goals met: 3 of 4
7. (op_1 obj_08 obj_02 obj_09)
   deleted: (pred_3 obj_08 obj_02)
   added: (pred_3 obj_08 obj_09)
   goals met: 3 of 4
8. (op_1 obj_04 obj_13 obj_09)
   deleted: (pred_3 obj_04 obj_13)
   added: (pred_3 obj_04 obj_09)
   goals met: 3 of 4
9. (op_3 obj_08 obj_10 obj_09 obj_05)
   deleted: (pred_2 obj_10 obj_09) (pred_1 obj_08 obj_05)
   added: (pred_4 obj_08 obj_10 obj_05)
   goals met: 3 of 4
10. (op_1 obj_08 obj_09 obj_02)
   deleted: (pred_3 obj_08 obj_09)
   added: (pred_3 obj_08 obj_02)
   goals met: 3 of 4
11. (op_2 obj_08 obj_10 obj_02 obj_05)
   deleted: (pred_4 obj_08 obj_10 obj_05)
   added: (pred_2 obj_10 obj_02) (pred_1 obj_08 obj_05)
   goals met: 4 of 4
